content/recipe/bbq-teriyaki-pork-kabobs.md
---
title: "BBQ Teriyaki Pork Kabobs"
author: ["Trev"]
date: 2022-03-22T00:00:00-07:00
lastmod: 2022-06-20T00:00:00-07:00
tags: ["GF"]
categories: ["entree"]
draft: false
servings: 6
prep-time: 30
cook-time: 20
ready-in: 230
---

## Ingredients {#ingredients}

-   3 tablespoons soy sauce
-   3 tablespoons olive oil
-   1 clove garlic, minced
-   1/2 teaspoon crushed red pepper flakes
-   salt and pepper to taste
-   1 pound boneless pork loin, cut into 1 inch cubes
-   1 (14.5 ounce) can low-sodium beef broth
-   2 tablespoons cornstarch
-   2 tablespoons wheat free tamari
-   1 tablespoon brown sugar
-   2 cloves garlic, minced
-   1/4 teaspoon ground ginger
-   3 portobello mushrooms, cut into quarters
-   1 large red onion, cut into 12 wedges
-   12 cherry tomatoes
-   12 bite-size chunks fresh pineapple


## Directions {#directions}

1.  In a shallow dish, mix together 3 tablespoons soy sauce, olive oil, 1 clove minced garlic, red pepper flakes, salt, and pepper. Add pork cubes, and turn to coat evenly with marinade. Cover, and refrigerate for 3 hours.
2.  In a saucepan, combine beef broth, cornstarch, 2 tablespoons soy sauce, brown sugar, 2 cloves minced garlic, and ginger. Bring to a boil, stirring constantly. Reduce heat, and simmer 5 minutes.
3.  Preheat an outdoor grill for high heat and lightly oil grate. Thread pork cubes onto skewers, alternating with mushrooms, onion, tomatoes, and pineapple chunks.
4.  Cook on grill for 15 minutes, or until meat is cooked through. Turn skewers, and baste often with sauce during cooking.